package ch03_연산자;

/**
 * 삼항 연산자
 * ? :
 * 피연산자1? 피연산자2: 피연산자3;
 * (조건) ? 피연산자2 : 피연산자2;
 * 
 * 조건이 true이면 피연산자2를, 아니면 피연산자3을처리한다.
 * 
 * 연산자의 우선순위
 * 1.단항  2.이항   3.삼항
 * 2.산술  2.비교   3.논리  4.삼항  5.대입
 * 
 * 1.증감(++,--), 부호(+,-), 논리(!)
 * 2.ㅏㄴ술(*,/,%)
 * 3.산술(+,-)
 * 4.비교(>,<,>=,<=)
 * 5.비교(==,!=)
 * 6.논리(&&)
 * 7.논리(||)
 * 8.조건(?:)
 * 9.(대입(=,+=,-=,*=,/=,%=)
 * 
 * 연산의 방향
 * 		- 일반적으로 왼쪽에서 오른쪽 방향
 * 		- 단, 단항.삼항.대입 3가지는 오른쪽에서 왼쪽 방향으로 연산된다.
 * 
 */
public class Ex07_삼항연산자 {

	public static void main(String[] args) {
		int score = 85;
		char grade = (score > 90) ? 'A' : ( (score > 80) ? 'B' : 'C' );
		System.out.println(score + "점은 " + grade + "등급입니다.");

	}

}
